<template>
  <div>
    <router-view></router-view>
    <div class="container">
      <div></div>
      <div class="cont-box">
        <p style="text-align: center;font-size: x-large">راه حلی امروزی‌تر برای خرید و فروش پوشاک</p>
        <p style="padding-right: 80px;padding-left: 80px;line-height: 2.5">

          توسعه اینترنت روش‌های خرید ما را به کلی دگرگون کرده است. منافع موجود در خرید اینترنتی هر روز تعداد بیشتری از
          مردم را به تجربه آن و ایجاد تغییر در الگوهای متداول خرید ترغیب می‏‌کند. امروز دیگر افراد این روش خرید را بیشتر
          منطبق بر شرایط زندگی مدرن می‏‏‏‌بینند. ویژگی‏‏‏‌ها و طبیعت خرید اینترنتی با روحیات و نیازهای رو به رشد ما
          هماهنگ‏‏‌تر شده است. همه سخت در حال تلاش برای پیشرفت‏‏‌های شخصی و جمعی خود هستیم.
          امروزه بهای اوقات فراغت ما با وجود مشغله‏‌های روزانه بسیار گرانبها‌تر شده است. همه ما برای این اوقات برنامه
          ریزی فشرده‏‌تری داریم. دیگر صرف زمان‌هایی نسبتا طولانی در فعالیت‏‌های نه‌چندان با اهمیت مانند خرید و سفرهای
          شهری برای بسیاری از انسان‌ها اولویت خود را از دست داده است. هوشمندی انسان‌ها، آنها را مجاب می‏‌کند که با تغییر
          در الگوهای قدیمی و نا‏کارآمد زندگی، هوشمندانه‏‌تر و امروزی‏‌تر زندگی کنند. صرف اوقات فراغت برای تفریح، آموزش،
          ورزش، لذت بردن از علایق شخصی و رفع خستگی‏‏‌های روزانه اولویت بیشتری نسبت به فعالیت‌‏‏‏های وقت‌گیر و در عین حال
          کم اهمیت‏‏‏‌تر مانند خرید کردن دارند.
          امروز دیگر برای بیشتر نیازهای روزمره راه‏ حل‏‏‏‌های جدیدتری وجود دارد، از جمله برای انتخاب و خرید کالا. دیگر
          کمتر کسی برای خرید کالا، بدون تحقیق و بررسی دقیق اقدام می‏‌کند.
          مشتریان پیشاپیش و قبل از خرید از حق انتخاب گسترده خود و اطلاعات موجود نهایت استفاده را می‏‌برند. مشتری در
          دنیای امروز حق انتخاب بیشتری را طلب می‏‌کند و مایل است دقیق‏‌تر و با قطعیت بیشتری انتخاب کند. زندگی امروزی
          بی‏‌گمان خرید به رو‏‌ش‌های نو‏تر، هوشمندانه‏‌تر و البته لذت‏‏ بخش‏‌تری را می‏‌طلبد. از همین روست که هر روز به
          تعداد استفاده‏ کنندگان سرویس‌های اینترنتی و مشتریان فروشگاه‏‏‌‏های اینترنتی افزوده می‌‏‏شود.</p>

      </div>
      <div></div>


    </div>
    <div style="display: grid;grid-template-columns: 0.2fr 1fr 0.2fr;margin-top: 200px">
      <div></div>
      <div style="display: grid;grid-template-columns: 1fr 3fr">
        <h1 style="font-size: 80px;color: #EF394E;font-style: oblique">store</h1>
        <p style="line-height: 33px">استور مرجع تخصصی نقد و بررسی و فروش اینترنتی پوشاک در ایران است. گروه‏‏‌های
          مختلف پوشاک با تنوعی بی‌نظیر در استور عرضه می‏‏‏‌شوند.
          مغازه داران عزیزی که در کار فروش پوشاک هستند می توانند در استور ثبت نام کرده و محصولات خود را در معرض دید عموم قراردهند و به فروش برسانند.

          استور با در اختیار داشتن سهم عمده‏‌ای از بازار عرضه اینترنتی پوشاک در ایران با تنوعی بسیار بالا از برندهای
          مختلف، در همراهی مشتریان در فرآیند خرید و حفظ جایگاه بی‏‏‏‌طرفانه در میان آنها، نهایت تلاش خود را می‌‏‏کند.
          کاربران و مشتریان استور می‏‏‌توانند با حق انتخابی بسیار بالا و با دریافت اطلاعاتی کامل برای انتخاب درست
          کالای مورد نظر خود، وب سایت استور را بررسی کنند و با حداکثر اطمینان کالای خود را انتخاب و خرید کنند.
          همواره بهترین انتخاب و بهترین خدمات، شایسته مشتری استور است.</p>
      </div>
      <div></div>


    </div>
    <div style="display: grid;grid-template-columns: 0.2fr 1fr 0.2fr;margin-top: 40px">
      <div></div>
      <div>استور از اولین دریافت کنندگان نماد اعتماد الکترونیک از مرکز توسعه تجارت الکترونیک وزارت صنعت، معدن و
        تجارت و به عنوان برگزیده بسیاری از مراجع و نهادهای ذی‏ربط، دارای کلیه مجوزهای رسمی مورد نیاز برای فعالیت در این
        حوزه است‏ .همچنین، در حال حاضر استور با توجه به استقبال چشمگیر کاربران و مشتریان خود، پرمخاطب‏‏‏‌ترین و
        پربازدیدترین وب‏ سایت تجاری کشور است. (به استناد آمارهای منتشر شده در مراجع آماری مانند Alexa)
      </div>
    </div>
    <div style="display: grid;grid-template-columns: 0.2fr 0.6fr 0.2fr ">
      <div></div>
      <div style="font-size: 18px;color: #EF394E;;margin-top: 120px;display: grid;grid-template-columns:  1fr 1fr 1fr ">
        <div style="border-left: 1px solid #222222;text-align: center">کاربران سایت
          <p style="font-size: 13px;color: #222222;margin-top: 25px">کاربران می توانند از محصولات مغازه ها دیدن کنند و
            محصول مورد نظر خود را پیدا کرده و برای خرید اینترنتی
            اقدام بکنند</p></div>
        <div style="font-size: 18px;color: #EF394E;;border-left: 1px solid #222222;text-align: center">صاحبان فروشگاه
          <p style="font-size: 13px;color: #222222;margin-top: 25px">همچنین  مغازه داران می توانند مغازه خود را در استور ثبت کنند و محصولات خود را به نمایش بگذارند و امکان
            فروش محصولات خود را داشته باشند</p></div>
        <div style="font-size: 18px;color: #EF394E;;text-align: center">راه های ارتباطی با ما
          <p style="font-size: 13px;color: #222222;margin-top: 25px">شماره تماس : 09124587965</p>
          <p style="font-size: 13px;color: #222222">ایمیل سایت : info.store@yahoo.com</p>
          <p style="font-size: 13px;color: #222222">تلگرام استور : t.me/store_iran </p>
        </div>
      </div>
    </div>
  </div>

</template>

<script>
  import axios from 'axios';

  export default {
    data() {
      return {
        user: {
          name: '',
          mail: ''
        }
      }
    },

    methods: {
      send() {
        axios.post('https://vue-http-b106e.firebaseio.com/data.json', this.user)
          .then(res => console.log(res))
          .catch(err => console.log(err))
      }
    }

  }
</script>

<style scoped>
  .container {
    display: grid;
    grid-template-columns: 0.2fr 1fr 0.2fr;
    margin-top: 70px;
  }

  .cont-box {
    border: 1px solid #c3c7c6;
    display: grid;
    grid-template-columns: 1fr;

    background-color: rgba(251, 52, 73, .6);
  }
</style>
